iNavFlight/inav/lib/main/ChibiOS/community/os/common/ext/MSP430/inc/msp430fr6989.h
sfr_w(ESIDEBUG1);                             /* ESI debug register 1 */
sfr_b(ESIDEBUG1_L);                           /* ESI debug register 1 */
sfr_b(ESIDEBUG1_H);                           /* ESI debug register 1 */
sfr_w(ESIDEBUG2);                             /* ESI debug register 2 */
sfr_b(ESIDEBUG2_L);                           /* ESI debug register 2 */
sfr_b(ESIDEBUG2_H);                           /* ESI debug register 2 */
sfr_w(ESIDEBUG3);                             /* ESI debug register 3 */
sfr_b(ESIDEBUG3_L);                           /* ESI debug register 3 */
sfr_b(ESIDEBUG3_H);                           /* ESI debug register 3 */
sfr_w(ESIDEBUG4);                             /* ESI debug register 4 */
sfr_b(ESIDEBUG4_L);                           /* ESI debug register 4 */
sfr_b(ESIDEBUG4_H);                           /* ESI debug register 4 */
sfr_w(ESIDEBUG5);                             /* ESI debug register 5 */
sfr_b(ESIDEBUG5_L);                           /* ESI debug register 5 */
sfr_b(ESIDEBUG5_H);                           /* ESI debug register 5 */
sfr_w(ESICNT0);                               /* ESI PSM counter 0 */
sfr_b(ESICNT0_L);                             /* ESI PSM counter 0 */
sfr_b(ESICNT0_H);                             /* ESI PSM counter 0 */
sfr_w(ESICNT1);                               /* ESI PSM counter 1 */
sfr_b(ESICNT1_L);                             /* ESI PSM counter 1 */
sfr_b(ESICNT1_H);                             /* ESI PSM counter 1 */
sfr_w(ESICNT2);                               /* ESI PSM counter 2 */
sfr_b(ESICNT2_L);                             /* ESI PSM counter 2 */
sfr_b(ESICNT2_H);                             /* ESI PSM counter 2 */
sfr_w(ESICNT3);                               /* ESI oscillator counter register */
sfr_b(ESICNT3_L);                             /* ESI oscillator counter register */
sfr_b(ESICNT3_H);                             /* ESI oscillator counter register */
sfr_w(ESIIV);                                 /* ESI interrupt vector */
sfr_b(ESIIV_L);                               /* ESI interrupt vector */
sfr_b(ESIIV_H);                               /* ESI interrupt vector */
sfr_w(ESIINT1);                               /* ESI interrupt register 1 */
sfr_b(ESIINT1_L);                             /* ESI interrupt register 1 */
sfr_b(ESIINT1_H);                             /* ESI interrupt register 1 */
sfr_w(ESIINT2);                               /* ESI interrupt register 2 */
sfr_b(ESIINT2_L);                             /* ESI interrupt register 2 */
sfr_b(ESIINT2_H);                             /* ESI interrupt register 2 */
sfr_w(ESIAFE);                                /* ESI AFE control register */
sfr_b(ESIAFE_L);                              /* ESI AFE control register */
sfr_b(ESIAFE_H);                              /* ESI AFE control register */
sfr_w(ESIPPU);                                /* ESI PPU control register */
sfr_b(ESIPPU_L);                              /* ESI PPU control register */
sfr_b(ESIPPU_H);                              /* ESI PPU control register */
sfr_w(ESITSM);                                /* ESI TSM control register */
sfr_b(ESITSM_L);                              /* ESI TSM control register */
sfr_b(ESITSM_H);                              /* ESI TSM control register */
sfr_w(ESIPSM);                                /* ESI PSM control register */
sfr_b(ESIPSM_L);                              /* ESI PSM control register */
sfr_b(ESIPSM_H);                              /* ESI PSM control register */
sfr_w(ESIOSC);                                /* ESI oscillator control register*/
sfr_b(ESIOSC_L);                              /* ESI oscillator control register*/
sfr_b(ESIOSC_H);                              /* ESI oscillator control register*/
sfr_w(ESICTL);                                /* ESI control register */
sfr_b(ESICTL_L);                              /* ESI control register */
sfr_b(ESICTL_H);                              /* ESI control register */
sfr_w(ESITHR1);                               /* ESI PSM Counter Threshold 1 register */
sfr_b(ESITHR1_L);                             /* ESI PSM Counter Threshold 1 register */
sfr_b(ESITHR1_H);                             /* ESI PSM Counter Threshold 1 register */
sfr_w(ESITHR2);                               /* ESI PSM Counter Threshold 2 register */
sfr_b(ESITHR2_L);                             /* ESI PSM Counter Threshold 2 register */
sfr_b(ESITHR2_H);                             /* ESI PSM Counter Threshold 2 register */
sfr_w(ESIDAC1R0);                             /* ESI DAC1 register 0 */
sfr_b(ESIDAC1R0_L);                           /* ESI DAC1 register 0 */
sfr_b(ESIDAC1R0_H);                           /* ESI DAC1 register 0 */
sfr_w(ESIDAC1R1);                             /* ESI DAC1 register 1 */
sfr_b(ESIDAC1R1_L);                           /* ESI DAC1 register 1 */
sfr_b(ESIDAC1R1_H);                           /* ESI DAC1 register 1 */
sfr_w(ESIDAC1R2);                             /* ESI DAC1 register 2 */
sfr_b(ESIDAC1R2_L);                           /* ESI DAC1 register 2 */
sfr_b(ESIDAC1R2_H);                           /* ESI DAC1 register 2 */
sfr_w(ESIDAC1R3);                             /* ESI DAC1 register 3 */
sfr_b(ESIDAC1R3_L);                           /* ESI DAC1 register 3 */
sfr_b(ESIDAC1R3_H);                           /* ESI DAC1 register 3 */
sfr_w(ESIDAC1R4);                             /* ESI DAC1 register 4 */
sfr_b(ESIDAC1R4_L);                           /* ESI DAC1 register 4 */
sfr_b(ESIDAC1R4_H);                           /* ESI DAC1 register 4 */
sfr_w(ESIDAC1R5);                             /* ESI DAC1 register 5 */
sfr_b(ESIDAC1R5_L);                           /* ESI DAC1 register 5 */
sfr_b(ESIDAC1R5_H);                           /* ESI DAC1 register 5 */
sfr_w(ESIDAC1R6);                             /* ESI DAC1 register 6 */
sfr_b(ESIDAC1R6_L);                           /* ESI DAC1 register 6 */
sfr_b(ESIDAC1R6_H);                           /* ESI DAC1 register 6 */
sfr_w(ESIDAC1R7);                             /* ESI DAC1 register 7 */
sfr_b(ESIDAC1R7_L);                           /* ESI DAC1 register 7 */
sfr_b(ESIDAC1R7_H);                           /* ESI DAC1 register 7 */
sfr_w(ESIDAC2R0);                             /* ESI DAC2 register 0 */
sfr_b(ESIDAC2R0_L);                           /* ESI DAC2 register 0 */
sfr_b(ESIDAC2R0_H);                           /* ESI DAC2 register 0 */
sfr_w(ESIDAC2R1);                             /* ESI DAC2 register 1 */
sfr_b(ESIDAC2R1_L);                           /* ESI DAC2 register 1 */
sfr_b(ESIDAC2R1_H);                           /* ESI DAC2 register 1 */
sfr_w(ESIDAC2R2);                             /* ESI DAC2 register 2 */
sfr_b(ESIDAC2R2_L);                           /* ESI DAC2 register 2 */
sfr_b(ESIDAC2R2_H);                           /* ESI DAC2 register 2 */
sfr_w(ESIDAC2R3);                             /* ESI DAC2 register 3 */
sfr_b(ESIDAC2R3_L);                           /* ESI DAC2 register 3 */
sfr_b(ESIDAC2R3_H);                           /* ESI DAC2 register 3 */
sfr_w(ESIDAC2R4);                             /* ESI DAC2 register 4 */
sfr_b(ESIDAC2R4_L);                           /* ESI DAC2 register 4 */
sfr_b(ESIDAC2R4_H);                           /* ESI DAC2 register 4 */
sfr_w(ESIDAC2R5);                             /* ESI DAC2 register 5 */
sfr_b(ESIDAC2R5_L);                           /* ESI DAC2 register 5 */
sfr_b(ESIDAC2R5_H);                           /* ESI DAC2 register 5 */
sfr_w(ESIDAC2R6);                             /* ESI DAC2 register 6 */
sfr_b(ESIDAC2R6_L);                           /* ESI DAC2 register 6 */
sfr_b(ESIDAC2R6_H);                           /* ESI DAC2 register 6 */
sfr_w(ESIDAC2R7);                             /* ESI DAC2 register 7 */
sfr_b(ESIDAC2R7_L);                           /* ESI DAC2 register 7 */
sfr_b(ESIDAC2R7_H);                           /* ESI DAC2 register 7 */
sfr_w(ESITSM0);                               /* ESI TSM 0 */
sfr_b(ESITSM0_L);                             /* ESI TSM 0 */
sfr_b(ESITSM0_H);                             /* ESI TSM 0 */
sfr_w(ESITSM1);                               /* ESI TSM 1 */
sfr_b(ESITSM1_L);                             /* ESI TSM 1 */
sfr_b(ESITSM1_H);                             /* ESI TSM 1 */
sfr_w(ESITSM2);                               /* ESI TSM 2 */
sfr_b(ESITSM2_L);                             /* ESI TSM 2 */
sfr_b(ESITSM2_H);                             /* ESI TSM 2 */
sfr_w(ESITSM3);                               /* ESI TSM 3 */
sfr_b(ESITSM3_L);                             /* ESI TSM 3 */
sfr_b(ESITSM3_H);                             /* ESI TSM 3 */
sfr_w(ESITSM4);                               /* ESI TSM 4 */
sfr_b(ESITSM4_L);                             /* ESI TSM 4 */
sfr_b(ESITSM4_H);                             /* ESI TSM 4 */
sfr_w(ESITSM5);                               /* ESI TSM 5 */
sfr_b(ESITSM5_L);                             /* ESI TSM 5 */
sfr_b(ESITSM5_H);                             /* ESI TSM 5 */
sfr_w(ESITSM6);                               /* ESI TSM 6 */
sfr_b(ESITSM6_L);                             /* ESI TSM 6 */
sfr_b(ESITSM6_H);                             /* ESI TSM 6 */
sfr_w(ESITSM7);                               /* ESI TSM 7 */
sfr_b(ESITSM7_L);                             /* ESI TSM 7 */
sfr_b(ESITSM7_H);                             /* ESI TSM 7 */
sfr_w(ESITSM8);                               /* ESI TSM 8 */
sfr_b(ESITSM8_L);                             /* ESI TSM 8 */
sfr_b(ESITSM8_H);                             /* ESI TSM 8 */
sfr_w(ESITSM9);                               /* ESI TSM 9 */
sfr_b(ESITSM9_L);                             /* ESI TSM 9 */
sfr_b(ESITSM9_H);                             /* ESI TSM 9 */
sfr_w(ESITSM10);                              /* ESI TSM 10 */
sfr_b(ESITSM10_L);                            /* ESI TSM 10 */
sfr_b(ESITSM10_H);                            /* ESI TSM 10 */
sfr_w(ESITSM11);                              /* ESI TSM 11 */
sfr_b(ESITSM11_L);                            /* ESI TSM 11 */
sfr_b(ESITSM11_H);                            /* ESI TSM 11 */
sfr_w(ESITSM12);                              /* ESI TSM 12 */
sfr_b(ESITSM12_L);                            /* ESI TSM 12 */
sfr_b(ESITSM12_H);                            /* ESI TSM 12 */
sfr_w(ESITSM13);                              /* ESI TSM 13 */
sfr_b(ESITSM13_L);                            /* ESI TSM 13 */
sfr_b(ESITSM13_H);                            /* ESI TSM 13 */
sfr_w(ESITSM14);                              /* ESI TSM 14 */
sfr_b(ESITSM14_L);                            /* ESI TSM 14 */
sfr_b(ESITSM14_H);                            /* ESI TSM 14 */
sfr_w(ESITSM15);                              /* ESI TSM 15 */
sfr_b(ESITSM15_L);                            /* ESI TSM 15 */
sfr_b(ESITSM15_H);                            /* ESI TSM 15 */
sfr_w(ESITSM16);                              /* ESI TSM 16 */
sfr_b(ESITSM16_L);                            /* ESI TSM 16 */
sfr_b(ESITSM16_H);                            /* ESI TSM 16 */
sfr_w(ESITSM17);                              /* ESI TSM 17 */
sfr_b(ESITSM17_L);                            /* ESI TSM 17 */
sfr_b(ESITSM17_H);                            /* ESI TSM 17 */
sfr_w(ESITSM18);                              /* ESI TSM 18 */
sfr_b(ESITSM18_L);                            /* ESI TSM 18 */
sfr_b(ESITSM18_H);                            /* ESI TSM 18 */
sfr_w(ESITSM19);                              /* ESI TSM 19 */
sfr_b(ESITSM19_L);                            /* ESI TSM 19 */
sfr_b(ESITSM19_H);                            /* ESI TSM 19 */
sfr_w(ESITSM20);                              /* ESI TSM 20 */
sfr_b(ESITSM20_L);                            /* ESI TSM 20 */
sfr_b(ESITSM20_H);                            /* ESI TSM 20 */
sfr_w(ESITSM21);                              /* ESI TSM 21 */
sfr_b(ESITSM21_L);                            /* ESI TSM 21 */
sfr_b(ESITSM21_H);                            /* ESI TSM 21 */
sfr_w(ESITSM22);                              /* ESI TSM 22 */
sfr_b(ESITSM22_L);                            /* ESI TSM 22 */
sfr_b(ESITSM22_H);                            /* ESI TSM 22 */
sfr_w(ESITSM23);                              /* ESI TSM 23 */
sfr_b(ESITSM23_L);                            /* ESI TSM 23 */
sfr_b(ESITSM23_H);                            /* ESI TSM 23 */
sfr_w(ESITSM24);                              /* ESI TSM 24 */
sfr_b(ESITSM24_L);                            /* ESI TSM 24 */
sfr_b(ESITSM24_H);                            /* ESI TSM 24 */
sfr_w(ESITSM25);                              /* ESI TSM 25 */
sfr_b(ESITSM25_L);                            /* ESI TSM 25 */
sfr_b(ESITSM25_H);                            /* ESI TSM 25 */
sfr_w(ESITSM26);                              /* ESI TSM 26 */
sfr_b(ESITSM26_L);                            /* ESI TSM 26 */
sfr_b(ESITSM26_H);                            /* ESI TSM 26 */
sfr_w(ESITSM27);                              /* ESI TSM 27 */
sfr_b(ESITSM27_L);                            /* ESI TSM 27 */
sfr_b(ESITSM27_H);                            /* ESI TSM 27 */
sfr_w(ESITSM28);                              /* ESI TSM 28 */
sfr_b(ESITSM28_L);                            /* ESI TSM 28 */
sfr_b(ESITSM28_H);                            /* ESI TSM 28 */
sfr_w(ESITSM29);                              /* ESI TSM 29 */
sfr_b(ESITSM29_L);                            /* ESI TSM 29 */
sfr_b(ESITSM29_H);                            /* ESI TSM 29 */
sfr_w(ESITSM30);                              /* ESI TSM 30 */
sfr_b(ESITSM30_L);                            /* ESI TSM 30 */
sfr_b(ESITSM30_H);                            /* ESI TSM 30 */
sfr_w(ESITSM31);                              /* ESI TSM 31 */
sfr_b(ESITSM31_L);                            /* ESI TSM 31 */
sfr_b(ESITSM31_H);                            /* ESI TSM 31 */

/* ESIIV Control Bits */

#define ESIIV_NONE             (0x0000)       /* No ESI Interrupt Pending */
#define ESIIV_ESIIFG1          (0x0002)       /* rising edge of the ESISTOP(tsm) */
#define ESIIV_ESIIFG0          (0x0004)       /* ESIOUT0 to ESIOUT3 conditions selected by ESIIFGSETx bits */
#define ESIIV_ESIIFG8          (0x0006)       /* ESIOUT4 to ESIOUT7 conditions selected by ESIIFGSET2x bits */
#define ESIIV_ESIIFG3          (0x0008)       /* ESICNT1 counter conditions selected with the ESITHR1 and ESITHR2 registers */
#define ESIIV_ESIIFG6          (0x000A)       /* PSM transitions to a state with a Q7 bit */
#define ESIIV_ESIIFG5          (0x000C)       /* PSM transitions to a state with a Q6 bit */
#define ESIIV_ESIIFG4          (0x000E)       /* ESICNT2 counter conditions selected with the ESIIS2x bits */
#define ESIIV_ESIIFG7          (0x0010)       /* ESICNT0 counter conditions selected with the ESIIS0x bits */
#define ESIIV_ESIIFG2          (0x0012)       /* start of a TSM sequence */

/* ESIINT1 Control Bits */
#define ESIIFGSET22            (0x8000)       /* ESIIFG8 interrupt flag source */
#define ESIIFGSET21            (0x4000)       /* ESIIFG8 interrupt flag source */
#define ESIIFGSET20            (0x2000)       /* ESIIFG8 interrupt flag source */
#define ESIIFGSET12            (0x1000)       /* ESIIFG0 interrupt flag source */
#define ESIIFGSET11            (0x0800)       /* ESIIFG0 interrupt flag source */
#define ESIIFGSET10            (0x0400)       /* ESIIFG0 interrupt flag source */
#define ESIIE8                 (0x0100)       /* Interrupt enable */
#define ESIIE7                 (0x0080)       /* Interrupt enable */
#define ESIIE6                 (0x0040)       /* Interrupt enable */
#define ESIIE5                 (0x0020)       /* Interrupt enable */
#define ESIIE4                 (0x0010)       /* Interrupt enable */
#define ESIIE3                 (0x0008)       /* Interrupt enable */
#define ESIIE2                 (0x0004)       /* Interrupt enable */
#define ESIIE1                 (0x0002)       /* Interrupt enable */
#define ESIIE0                 (0x0001)       /* Interrupt enable */

/* ESIINT1 Control Bits */
#define ESIIE7_L               (0x0080)       /* Interrupt enable */
#define ESIIE6_L               (0x0040)       /* Interrupt enable */
#define ESIIE5_L               (0x0020)       /* Interrupt enable */
#define ESIIE4_L               (0x0010)       /* Interrupt enable */
#define ESIIE3_L               (0x0008)       /* Interrupt enable */
#define ESIIE2_L               (0x0004)       /* Interrupt enable */
#define ESIIE1_L               (0x0002)       /* Interrupt enable */
#define ESIIE0_L               (0x0001)       /* Interrupt enable */

/* ESIINT1 Control Bits */
#define ESIIFGSET22_H          (0x0080)       /* ESIIFG8 interrupt flag source */
#define ESIIFGSET21_H          (0x0040)       /* ESIIFG8 interrupt flag source */
#define ESIIFGSET20_H          (0x0020)       /* ESIIFG8 interrupt flag source */
#define ESIIFGSET12_H          (0x0010)       /* ESIIFG0 interrupt flag source */
#define ESIIFGSET11_H          (0x0008)       /* ESIIFG0 interrupt flag source */
#define ESIIFGSET10_H          (0x0004)       /* ESIIFG0 interrupt flag source */
#define ESIIE8_H               (0x0001)       /* Interrupt enable */

#define ESIIFGSET2_0           (0x0000)       /* ESIIFG8 is set when ESIOUT4 is set */
#define ESIIFGSET2_1           (0x2000)       /* ESIIFG8 is set when ESIOUT4 is reset */
#define ESIIFGSET2_2           (0x4000)       /* ESIIFG8 is set when ESIOUT5 is set */
#define ESIIFGSET2_3           (0x6000)       /* ESIIFG8 is set when ESIOUT5 is reset */
#define ESIIFGSET2_4           (0x8000)       /* ESIIFG8 is set when ESIOUT6 is set */
#define ESIIFGSET2_5           (0xA000)       /* ESIIFG8 is set when ESIOUT6 is reset */
#define ESIIFGSET2_6           (0xC000)       /* ESIIFG8 is set when ESIOUT7 is set */
#define ESIIFGSET2_7           (0xE000)       /* ESIIFG8 is set when ESIOUT7 is reset */
#define ESIIFGSET1_0           (0x0000)       /* ESIIFG0 is set when ESIOUT0 is set */
#define ESIIFGSET1_1           (0x0400)       /* ESIIFG0 is set when ESIOUT0 is reset */
#define ESIIFGSET1_2           (0x0800)       /* ESIIFG0 is set when ESIOUT1 is set */
#define ESIIFGSET1_3           (0x0C00)       /* ESIIFG0 is set when ESIOUT1 is reset */
#define ESIIFGSET1_4           (0x1000)       /* ESIIFG0 is set when ESIOUT2 is set */
#define ESIIFGSET1_5           (0x1400)       /* ESIIFG0 is set when ESIOUT2 is reset */
#define ESIIFGSET1_6           (0x1800)       /* ESIIFG0 is set when ESIOUT3 is set */
#define ESIIFGSET1_7           (0x1C00)       /* ESIIFG0 is set when ESIOUT3 is reset */

/* ESIINT2 Control Bits */
#define ESIIS21                (0x4000)       /* SIFIFG4 interrupt flag source */
#define ESIIS20                (0x2000)       /* SIFIFG4 interrupt flag source */
#define ESIIS01                (0x0800)       /* SIFIFG7 interrupt flag source */
#define ESIIS00                (0x0400)       /* SIFIFG7 interrupt flag source */
#define ESIIFG8                (0x0100)       /* ESIIFG8 interrupt pending */
#define ESIIFG7                (0x0080)       /* ESIIFG7 interrupt pending */
#define ESIIFG6                (0x0040)       /* ESIIFG6 interrupt pending */
#define ESIIFG5                (0x0020)       /* ESIIFG5 interrupt pending */
#define ESIIFG4                (0x0010)       /* ESIIFG4 interrupt pending */
#define ESIIFG3                (0x0008)       /* ESIIFG3 interrupt pending */
#define ESIIFG2                (0x0004)       /* ESIIFG2 interrupt pending */
#define ESIIFG1                (0x0002)       /* ESIIFG1 interrupt pending */
#define ESIIFG0                (0x0001)       /* ESIIFG0 interrupt pending */

/* ESIINT2 Control Bits */
#define ESIIFG7_L              (0x0080)       /* ESIIFG7 interrupt pending */
#define ESIIFG6_L              (0x0040)       /* ESIIFG6 interrupt pending */
#define ESIIFG5_L              (0x0020)       /* ESIIFG5 interrupt pending */
#define ESIIFG4_L              (0x0010)       /* ESIIFG4 interrupt pending */
#define ESIIFG3_L              (0x0008)       /* ESIIFG3 interrupt pending */
#define ESIIFG2_L              (0x0004)       /* ESIIFG2 interrupt pending */
#define ESIIFG1_L              (0x0002)       /* ESIIFG1 interrupt pending */
#define ESIIFG0_L              (0x0001)       /* ESIIFG0 interrupt pending */

/* ESIINT2 Control Bits */
#define ESIIS21_H              (0x0040)       /* SIFIFG4 interrupt flag source */
#define ESIIS20_H              (0x0020)       /* SIFIFG4 interrupt flag source */
#define ESIIS01_H              (0x0008)       /* SIFIFG7 interrupt flag source */
#define ESIIS00_H              (0x0004)       /* SIFIFG7 interrupt flag source */
#define ESIIFG8_H              (0x0001)       /* ESIIFG8 interrupt pending */

