iNavFlight/inav/lib/main/ChibiOS/community/os/common/ext/MSP430/inc/msp430fr6989.h
sfr_b(ESIRAM0);                               /* ESI RAM 0 */
sfr_b(ESIRAM1);                               /* ESI RAM 1 */
sfr_b(ESIRAM2);                               /* ESI RAM 2 */
sfr_b(ESIRAM3);                               /* ESI RAM 3 */
sfr_b(ESIRAM4);                               /* ESI RAM 4 */
sfr_b(ESIRAM5);                               /* ESI RAM 5 */
sfr_b(ESIRAM6);                               /* ESI RAM 6 */
sfr_b(ESIRAM7);                               /* ESI RAM 7 */
sfr_b(ESIRAM8);                               /* ESI RAM 8 */
sfr_b(ESIRAM9);                               /* ESI RAM 9 */
sfr_b(ESIRAM10);                              /* ESI RAM 10 */
sfr_b(ESIRAM11);                              /* ESI RAM 11 */
sfr_b(ESIRAM12);                              /* ESI RAM 12 */
sfr_b(ESIRAM13);                              /* ESI RAM 13 */
sfr_b(ESIRAM14);                              /* ESI RAM 14 */
sfr_b(ESIRAM15);                              /* ESI RAM 15 */
sfr_b(ESIRAM16);                              /* ESI RAM 16 */
sfr_b(ESIRAM17);                              /* ESI RAM 17 */
sfr_b(ESIRAM18);                              /* ESI RAM 18 */
sfr_b(ESIRAM19);                              /* ESI RAM 19 */
sfr_b(ESIRAM20);                              /* ESI RAM 20 */
sfr_b(ESIRAM21);                              /* ESI RAM 21 */
sfr_b(ESIRAM22);                              /* ESI RAM 22 */
sfr_b(ESIRAM23);                              /* ESI RAM 23 */
sfr_b(ESIRAM24);                              /* ESI RAM 24 */
sfr_b(ESIRAM25);                              /* ESI RAM 25 */
sfr_b(ESIRAM26);                              /* ESI RAM 26 */
sfr_b(ESIRAM27);                              /* ESI RAM 27 */
sfr_b(ESIRAM28);                              /* ESI RAM 28 */
sfr_b(ESIRAM29);                              /* ESI RAM 29 */
sfr_b(ESIRAM30);                              /* ESI RAM 30 */
sfr_b(ESIRAM31);                              /* ESI RAM 31 */
sfr_b(ESIRAM32);                              /* ESI RAM 32 */
sfr_b(ESIRAM33);                              /* ESI RAM 33 */
sfr_b(ESIRAM34);                              /* ESI RAM 34 */
sfr_b(ESIRAM35);                              /* ESI RAM 35 */
sfr_b(ESIRAM36);                              /* ESI RAM 36 */
sfr_b(ESIRAM37);                              /* ESI RAM 37 */
sfr_b(ESIRAM38);                              /* ESI RAM 38 */
sfr_b(ESIRAM39);                              /* ESI RAM 39 */
sfr_b(ESIRAM40);                              /* ESI RAM 40 */
sfr_b(ESIRAM41);                              /* ESI RAM 41 */
sfr_b(ESIRAM42);                              /* ESI RAM 42 */
sfr_b(ESIRAM43);                              /* ESI RAM 43 */
sfr_b(ESIRAM44);                              /* ESI RAM 44 */
sfr_b(ESIRAM45);                              /* ESI RAM 45 */
sfr_b(ESIRAM46);                              /* ESI RAM 46 */
sfr_b(ESIRAM47);                              /* ESI RAM 47 */
sfr_b(ESIRAM48);                              /* ESI RAM 48 */
sfr_b(ESIRAM49);                              /* ESI RAM 49 */
sfr_b(ESIRAM50);                              /* ESI RAM 50 */
sfr_b(ESIRAM51);                              /* ESI RAM 51 */
sfr_b(ESIRAM52);                              /* ESI RAM 52 */
sfr_b(ESIRAM53);                              /* ESI RAM 53 */
sfr_b(ESIRAM54);                              /* ESI RAM 54 */
sfr_b(ESIRAM55);                              /* ESI RAM 55 */
sfr_b(ESIRAM56);                              /* ESI RAM 56 */
sfr_b(ESIRAM57);                              /* ESI RAM 57 */
sfr_b(ESIRAM58);                              /* ESI RAM 58 */
sfr_b(ESIRAM59);                              /* ESI RAM 59 */
sfr_b(ESIRAM60);                              /* ESI RAM 60 */
sfr_b(ESIRAM61);                              /* ESI RAM 61 */
sfr_b(ESIRAM62);                              /* ESI RAM 62 */
sfr_b(ESIRAM63);                              /* ESI RAM 63 */
sfr_b(ESIRAM64);                              /* ESI RAM 64 */
sfr_b(ESIRAM65);                              /* ESI RAM 65 */
sfr_b(ESIRAM66);                              /* ESI RAM 66 */
sfr_b(ESIRAM67);                              /* ESI RAM 67 */
sfr_b(ESIRAM68);                              /* ESI RAM 68 */
sfr_b(ESIRAM69);                              /* ESI RAM 69 */
sfr_b(ESIRAM70);                              /* ESI RAM 70 */
sfr_b(ESIRAM71);                              /* ESI RAM 71 */
sfr_b(ESIRAM72);                              /* ESI RAM 72 */
sfr_b(ESIRAM73);                              /* ESI RAM 73 */
sfr_b(ESIRAM74);                              /* ESI RAM 74 */
sfr_b(ESIRAM75);                              /* ESI RAM 75 */
sfr_b(ESIRAM76);                              /* ESI RAM 76 */
sfr_b(ESIRAM77);                              /* ESI RAM 77 */
sfr_b(ESIRAM78);                              /* ESI RAM 78 */
sfr_b(ESIRAM79);                              /* ESI RAM 79 */
sfr_b(ESIRAM80);                              /* ESI RAM 80 */
sfr_b(ESIRAM81);                              /* ESI RAM 81 */
sfr_b(ESIRAM82);                              /* ESI RAM 82 */
sfr_b(ESIRAM83);                              /* ESI RAM 83 */
sfr_b(ESIRAM84);                              /* ESI RAM 84 */
sfr_b(ESIRAM85);                              /* ESI RAM 85 */
sfr_b(ESIRAM86);                              /* ESI RAM 86 */
sfr_b(ESIRAM87);                              /* ESI RAM 87 */
sfr_b(ESIRAM88);                              /* ESI RAM 88 */
sfr_b(ESIRAM89);                              /* ESI RAM 89 */
sfr_b(ESIRAM90);                              /* ESI RAM 90 */
sfr_b(ESIRAM91);                              /* ESI RAM 91 */
sfr_b(ESIRAM92);                              /* ESI RAM 92 */
sfr_b(ESIRAM93);                              /* ESI RAM 93 */
sfr_b(ESIRAM94);                              /* ESI RAM 94 */
sfr_b(ESIRAM95);                              /* ESI RAM 95 */
sfr_b(ESIRAM96);                              /* ESI RAM 96 */
sfr_b(ESIRAM97);                              /* ESI RAM 97 */
sfr_b(ESIRAM98);                              /* ESI RAM 98 */
sfr_b(ESIRAM99);                              /* ESI RAM 99 */
sfr_b(ESIRAM100);                             /* ESI RAM 100 */
sfr_b(ESIRAM101);                             /* ESI RAM 101 */
sfr_b(ESIRAM102);                             /* ESI RAM 102 */
sfr_b(ESIRAM103);                             /* ESI RAM 103 */
sfr_b(ESIRAM104);                             /* ESI RAM 104 */
sfr_b(ESIRAM105);                             /* ESI RAM 105 */
sfr_b(ESIRAM106);                             /* ESI RAM 106 */
sfr_b(ESIRAM107);                             /* ESI RAM 107 */
sfr_b(ESIRAM108);                             /* ESI RAM 108 */
sfr_b(ESIRAM109);                             /* ESI RAM 109 */
sfr_b(ESIRAM110);                             /* ESI RAM 110 */
sfr_b(ESIRAM111);                             /* ESI RAM 111 */
sfr_b(ESIRAM112);                             /* ESI RAM 112 */
sfr_b(ESIRAM113);                             /* ESI RAM 113 */
sfr_b(ESIRAM114);                             /* ESI RAM 114 */
sfr_b(ESIRAM115);                             /* ESI RAM 115 */
sfr_b(ESIRAM116);                             /* ESI RAM 116 */
sfr_b(ESIRAM117);                             /* ESI RAM 117 */
sfr_b(ESIRAM118);                             /* ESI RAM 118 */
sfr_b(ESIRAM119);                             /* ESI RAM 119 */
sfr_b(ESIRAM120);                             /* ESI RAM 120 */
sfr_b(ESIRAM121);                             /* ESI RAM 121 */
sfr_b(ESIRAM122);                             /* ESI RAM 122 */
sfr_b(ESIRAM123);                             /* ESI RAM 123 */
sfr_b(ESIRAM124);                             /* ESI RAM 124 */
sfr_b(ESIRAM125);                             /* ESI RAM 125 */
sfr_b(ESIRAM126);                             /* ESI RAM 126 */
sfr_b(ESIRAM127);                             /* ESI RAM 127 */
/*************************************************************
* FRAM Memory
*************************************************************/
#define __MSP430_HAS_FRAM__                   /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_FRAM__ 0x0140
#define FRAM_BASE              __MSP430_BASEADDRESS_FRAM__
#define __MSP430_HAS_GC__                     /* Definition to show that Module is available */

sfr_w(FRCTL0);                                /* FRAM Controller Control 0 */
sfr_b(FRCTL0_L);                              /* FRAM Controller Control 0 */
sfr_b(FRCTL0_H);                              /* FRAM Controller Control 0 */
sfr_w(GCCTL0);                                /* General Control 0 */
sfr_b(GCCTL0_L);                              /* General Control 0 */
sfr_b(GCCTL0_H);                              /* General Control 0 */
sfr_w(GCCTL1);                                /* General Control 1 */
sfr_b(GCCTL1_L);                              /* General Control 1 */
sfr_b(GCCTL1_H);                              /* General Control 1 */

#define FRCTLPW                (0xA500)       /* FRAM password for write */
#define FRPW                   (0x9600)       /* FRAM password returned by read */
#define FWPW                   (0xA500)       /* FRAM password for write */
#define FXPW                   (0x3300)       /* for use with XOR instruction */

/* FRCTL0 Control Bits */
//#define RESERVED            (0x0001)  /* RESERVED */
//#define RESERVED            (0x0002)  /* RESERVED */
//#define RESERVED            (0x0004)  /* RESERVED */
#define NWAITS0                (0x0010)       /* FRAM Wait state control Bit: 0 */
#define NWAITS1                (0x0020)       /* FRAM Wait state control Bit: 1 */
#define NWAITS2                (0x0040)       /* FRAM Wait state control Bit: 2 */
//#define RESERVED            (0x0080)  /* RESERVED */

/* FRCTL0 Control Bits */
//#define RESERVED            (0x0001)  /* RESERVED */
//#define RESERVED            (0x0002)  /* RESERVED */
//#define RESERVED            (0x0004)  /* RESERVED */
#define NWAITS0_L              (0x0010)       /* FRAM Wait state control Bit: 0 */
#define NWAITS1_L              (0x0020)       /* FRAM Wait state control Bit: 1 */
#define NWAITS2_L              (0x0040)       /* FRAM Wait state control Bit: 2 */
//#define RESERVED            (0x0080)  /* RESERVED */

#define NWAITS_0               (0x0000)       /* FRAM Wait state control: 0 */
#define NWAITS_1               (0x0010)       /* FRAM Wait state control: 1 */
#define NWAITS_2               (0x0020)       /* FRAM Wait state control: 2 */
#define NWAITS_3               (0x0030)       /* FRAM Wait state control: 3 */
#define NWAITS_4               (0x0040)       /* FRAM Wait state control: 4 */
#define NWAITS_5               (0x0050)       /* FRAM Wait state control: 5 */
#define NWAITS_6               (0x0060)       /* FRAM Wait state control: 6 */
#define NWAITS_7               (0x0070)       /* FRAM Wait state control: 7 */

/* GCCTL0 Control Bits */
//#define RESERVED            (0x0001)  /* RESERVED */
#define FRLPMPWR               (0x0002)       /* FRAM Enable FRAM auto power up after LPM */
#define FRPWR                  (0x0004)       /* FRAM Power Control */
#define ACCTEIE                (0x0008)       /* RESERVED */
//#define RESERVED            (0x0010)  /* RESERVED */
#define CBDIE                  (0x0020)       /* Enable NMI event if correctable bit error detected */
#define UBDIE                  (0x0040)       /* Enable NMI event if uncorrectable bit error detected */
#define UBDRSTEN               (0x0080)       /* Enable Power Up Clear (PUC) reset if FRAM uncorrectable bit error detected */

/* GCCTL0 Control Bits */
//#define RESERVED            (0x0001)  /* RESERVED */
#define FRLPMPWR_L             (0x0002)       /* FRAM Enable FRAM auto power up after LPM */
#define FRPWR_L                (0x0004)       /* FRAM Power Control */
#define ACCTEIE_L              (0x0008)       /* RESERVED */
//#define RESERVED            (0x0010)  /* RESERVED */
#define CBDIE_L                (0x0020)       /* Enable NMI event if correctable bit error detected */
#define UBDIE_L                (0x0040)       /* Enable NMI event if uncorrectable bit error detected */
#define UBDRSTEN_L             (0x0080)       /* Enable Power Up Clear (PUC) reset if FRAM uncorrectable bit error detected */

